# --- ЭТАП 1: СБОРКА ПРОЕКТА ---
# Мы берем образ, где уже установлены и Java 21, и сборщик Maven на базе легкого Alpine Linux
FROM maven:3.9.6-eclipse-temurin-21-alpine AS builder

# Указываем рабочую папку внутри контейнера-сборщика. Все команды ниже будут выполняться в ней
WORKDIR /app

# Копируем наш файл со списком зависимостей pom.xml в корень папки /app
COPY pom.xml .

# Копируем всю папку с нашим исходным кодом (папку src) внутрь контейнера
COPY src ./src

# Запускаем сборку джарника прямо внутри контейнера
RUN mvn clean package -DskipTests

# --- ЭТАП 2: ЗАПУСК ПРИЛОЖЕНИЯ ---
# Берем чистый образ, где есть только среда запуска JRE 21
FROM eclipse-temurin:21-jre-alpine

# Создаем чистую рабочую папку в финальном контейнере
WORKDIR /app

# Заходим в первый контейнер builder, идем в его папку /app/target,
# находим там наш готовый скомпилированный файл demo-1.0.0.jar и копируем его к себе под коротким именем app.jar
COPY --from=builder /app/target/demo-1.0.0.jar app.jar

# Документируем, что наше Spring Boot приложение внутри контейнера будет слушать порт 8080
EXPOSE 8080

# Главная команда, которая включает виртуальную машину Java и запускает скомпилированный "черный ящик"
CMD ["java", "-jar", "app.jar"]